#lang racket



Ben 的程序并不安全,而且会阻止单一对象进行并发。

考虑原本未修改的 make-account 程序，如果执行以下的求值序列的话，那么所有表达式都会被放进串行化组 protected 当中，其中每个操作符都是一个 protected 的串行化实例：







              ...
               ^
               |
+---------------------------------------------------------------------------------------------------------------+
|                                                                                                               |
| protected                                                                                                     |
|                                                                                                               |
+---------------------------------------------------------------------------------------------------------------+
     |                          |                          |                            |
     | ((protected withdraw)    | ((protected withdraw)    | ((protected withdraw)      | ((protected withdraw)
     |  10)                     |  20)                     |  30)                       |  40)
     |                          |                          |                            |
     v                          v                          v                            v
+----------------+     +----------------+       +----------------+              +----------------+
|                |     |                |       |                |              |                |
| 串行化地运行着  |     | 串行化地运行着  |       | 串行化地运行着  |              | 串行化地运行着  |
| (withdraw 10)  |     | (withdraw 20)  |       | (withdraw 30)  |              | (withdraw 40)  |
|                |     |                |       |                |              |                |
+----------------+     +----------------+       +----------------+              +----------------+




                                  +-------------------------+
                                   |                         |
                                   | protected               |
                                   |                         |
                                   +-------------------------+
                                       ^
                                       |
                                       |
                           失败    +-------------------------+
(protected-withdraw 20)\<--------------+                     |                 (protected-withdraw 10)
(protected-withdraw 30)+-----------> protected-withdraw <------------------+
(protected-withdraw 40)/ 尝试调用  | protected-deposit       |             |
                                   |                         |             |
                                   +-------------------------+             |
                                                                   +----------------+
                                                                   |                |
                                                                   | 串行化地运行着 |
                                                                   | (withdraw 10)  |
                                                                   |                |
                                                                   +----------------+















